<!-- dflook/terraform-github-actions {"workspace":"fix-root-tool-versions-2","backend_type":"remote","backend":"b5a639bd5bada9fc47060f51524957ca5723726453a882e296d1be22f1a3a864","plan_job_ref":"Job Test Terraform cloud #226 at https://github.com/dflook/terraform-github-actions/actions/runs/7555968671","plan_hash":"806580341672bc18808b726e674f1cf594a0a2f80caf2f1f75ea8b61fb680038","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-cloud/0.13__ in the __fix-root-tool-versions-2__ workspace
With var files: `tests/workflows/test-cloud/0.13/my_variable.tfvars
`
With variables: `from_variables = "from_variables"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.the_id will be created
+   resource "random_id" "the_id" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 5
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Test Terraform cloud #226](https://github.com/dflook/terraform-github-actions/actions/runs/7555968671)